In [5]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [1]:
import numpy as np
import pandas as pd

In [18]:
df=pd.DataFrame(data=np.arange(0,20).reshape(4,5),index=["Row1","Row2","Row3","Row4"],columns=["Column1","Column2","Column3","Column4","Column5"])

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19

In [20]:
type(df)

pandas.core.frame.DataFrame

In [75]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Column5    4
Name: Row1, dtype: int32

In [25]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_built_with_meson',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_pandas_datetime_CAPI',
 '_pandas_parser_CAPI',
 '_testing',
 '_typing',
 '_version_meson',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [26]:
df.head()

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19

In [30]:
df.iloc[0:2,2:4]

      Column3  Column4
Row1        2        3
Row2        7        8

In [31]:
df.describe()

         Column1    Column2    Column3    Column4    Column5
count   4.000000   4.000000   4.000000   4.000000   4.000000
mean    7.500000   8.500000   9.500000  10.500000  11.500000
std     6.454972   6.454972   6.454972   6.454972   6.454972
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%     3.750000   4.750000   5.750000   6.750000   7.750000
50%     7.500000   8.500000   9.500000  10.500000  11.500000
75%    11.250000  12.250000  13.250000  14.250000  15.250000
max    15.000000  16.000000  17.000000  18.000000  19.000000

In [34]:
#converting dataframe into array
df.iloc[:,:].values

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [36]:
df['Column4'].value_counts()

Column4
3     1
8     1
13    1
18    1
Name: count, dtype: int64

In [40]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
Column5    0
dtype: int64

In [45]:
df['Column3'].unique()

array([ 2,  7, 12, 17])

In [77]:
df[(df['Column1']>2) & (df['Column1']<15)]

      Column1  Column2  Column3  Column4  Column5
Row2        5        6        7        8        9
Row3       10       11       12       13       14

# StringIO - In memory file format Object

In [81]:
import pandas as pd
from io import StringIO as sio

In [84]:
data = ('col1,col2,col3\n'
        '1,2,3\n'
        'h,j,4\n'
        't,r,e\n'
        '2,5,6')

In [85]:
type(data)

str

In [87]:
x=StringIO(data)

In [88]:
pd.read_csv(x)

  col1 col2 col3
0    1    2    3
1    h    j    4
2    t    r    e
3    2    5    6

In [96]:
df =pd.read_csv(StringIO(data),usecols=['col1','col2'])

In [104]:
df.to_csv('test.csv',index=False)

In [105]:
data = ('a,b,c,d\n'
            '1,2,3,4\n'
            '5,6,7,8\n'
            '9,10,11')

In [107]:
StringIO(data)

In [110]:
df=pd.read_csv(StringIO(data)

AttributeError: '_io.StringIO' object has no attribute 'datatype'

In [119]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [111]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       2 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 228.0 bytes

In [114]:
df=pd.read_csv(StringIO(data),dtype='object')

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [116]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [121]:
df.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [122]:
df['b'][1]

'6'

In [126]:
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':int})

In [127]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   b       3 non-null      float64
 2   c       3 non-null      int32
 3   d       2 non-null      float64
dtypes: float64(2), int32(2)
memory usage: 204.0 bytes

In [128]:
df

   a     b   c    d
0  1   2.0   3  4.0
1  5   6.0   7  8.0
2  9  10.0  11  NaN

In [131]:
df.dtypes

a      int32
b    float64
c      int32
d    float64
dtype: object

In [137]:
data = ('index,a,b,c\n'
           '4,apple,bat,5.7\n'
            '8,orange,cow,10')
pd.read_csv(StringIO(data),index_col=(0))

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [143]:
# use index cols and usecols
data = ('a,b,c\n'
           '4,apple,bat\n'
            '8,orange,cow')
pd.read_csv(StringIO(data),usecols =('a','b','c'),index_col=(0))

        b    c
a
4   apple  bat
8  orange  cow

In [165]:
df=pd.read_csv('8d3b6596-b09e-4077-aebf-425193185a5b.csv')
df2=df.head().to_csv('data.csv')

In [155]:
df=pd.read_csv('8d3b6596-b09e-4077-aebf-425193185a5b.csv')
df

,Month,Year,OIL COMPANIES,Quantity (000 Metric Tonnes)
0,April,2023,"IOCL-BARAUNI,BIHAR",546.51
1,April,2023,IOCL TOTAL,6037.64
2,April,2023,ONGC TOTAL,1475.55
3,April,2023,RIL TOTAL,5355.74
4,May,2023,"IOCL-MATHURA, UTTAR PRADESH",833.52
...,...,...,...,...
1387,August,2022,"IOCL-PARADIP,ODISHA",2.10
1388,August,2022,CPCL-TOTAL,940.43
1389,August,2022,RIL TOTAL,5176.59
1390,September,2022,"IOCL-KOYALI, GUJARAT",1270.87
1391,September,2022,"IOCL-PANIPAT, HARYANA",1153.66

In [172]:
df.head().to_csv('data.csv')
df.head().to_csv('data.csv',index=False)

# 2Reading HTML files in pandas

In [14]:
import pandas as pd
y=pd.read_html("https://en.wikipedia.org/wiki/ISO_4217", match="Replaced by")

In [15]:
y

[    Code  Num D[a]                    Currency        From       Until  \
 0    ADP  020    0             Andorran peseta        1869  1999-01-01
 1    AFA  004    2              Afghan afghani        1925        2003
 2    ALK  008    .            Old Albanian lek        1946        1965
 3    AOK  024    0              Angolan kwanza  1977-01-08  1990-09-24
 4    AON  024    0         Angolan novo kwanza  1990-09-25  1995-06-30
 ..   ...  ...  ...                         ...         ...         ...
 121  ZRZ  180    2               Zairean zaire        1967        1993
 122  ZWC  716    2            Rhodesian dollar  1970-02-17        1980
 123  ZWD  716    2   Zimbabwean dollar (first)  1980-04-18  2006-07-31
 124  ZWN  942    2  Zimbabwean dollar (second)  2006-08-01  2008-07-31
 125  ZWR  935    2   Zimbabwean dollar (third)  2008-08-01  2009-02-02

           Replaced by
 0                 EUR
 1                 AFN
 2                 NaN
 3           AON (AOA)
 4           AOR (AOA)
 ..                ...
 121         ZRN (CDF)
 122     ZWD (USD/ZWL)
 123     ZWN (USD/ZWL)
 124     ZWR (USD/ZWL)
 125  ZWL[g] (USD/ZWL)

 [126 rows x 7 columns]]

In [22]:
T=pd.read_html("https://en.wikipedia.org/wiki/India_national_cricket_team",match="Sponsorship for ICC Tournaments")

In [24]:
T[0]

                          Tournament Kit Manufacturer Sleeve Sponsor
0             1975 Cricket World Cup              NaN            NaN
1             1979 Cricket World Cup              NaN            NaN
2             1983 Cricket World Cup              NaN            NaN
3             1987 Cricket World Cup              NaN            NaN
4             1992 Cricket World Cup              ISC            NaN
5             1996 Cricket World Cup              NaN          Wills
6           1998 ICC KnockOut Trophy              NaN          Wills
7             1999 Cricket World Cup            ASICS          Wills
8           2000 ICC KnockOut Trophy              NaN          Wills
9          2002 ICC Champions Trophy            Omtex            NaN
10            2003 Cricket World Cup            Omtex   Aamby Valley
11         2004 ICC Champions Trophy            Omtex         Sahara
12         2006 ICC Champions Trophy             Nike         Sahara
13            2007 Cricket World Cup             Nike         Sahara
14      2007 ICC Men's T20 World Cup             Nike         Sahara
15      2009 ICC Men's T20 World Cup             Nike         Sahara
16         2009 ICC Champions Trophy             Nike         Sahara
17      2010 ICC Men's T20 World Cup             Nike         Sahara
18            2011 Cricket World Cup             Nike         Sahara
19      2012 ICC Men's T20 World Cup             Nike         Sahara
20         2013 ICC Champions Trophy             Nike         Sahara
21      2014 ICC Men's T20 World Cup             Nike     Star India
22            2015 Cricket World Cup             Nike     Star India
23      2016 ICC Men's T20 World Cup             Nike     Star India
24         2017 ICC Champions Trophy             Nike           OPPO
25            2019 Cricket World Cup             Nike           OPPO
26  2021 ICC World Test Championship       MPL Sports         BYJU's
27      2021 ICC Men's T20 World Cup       MPL Sports         BYJU's
28      2022 ICC Men's T20 World Cup       MPL Sports         BYJU's
29  2023 ICC World Test Championship           Adidas            NaN
30            2023 Cricket World Cup           Adidas        Dream11
31      2024 ICC Men's T20 World Cup           Adidas        Dream11
32         2025 ICC Champions Trophy           Adidas        Dream11

In [25]:
T[0].to_html("demo.html")

In [26]:
xml='''<?xml version="1.0"?>
<catalog>
   <book id="bk101">
      <author>Gambardella, Matthew</author>
      <title>XML Developer's Guide</title>
      <genre>Computer</genre>
      <price>44.95</price>
      <publish_date>2000-10-01</publish_date>
      <description>An in-depth look at creating applications 
      with XML.</description>
   </book>
   <book id="bk102">
      <author>Ralls, Kim</author>
      <title>Midnight Rain</title>
      <genre>Fantasy</genre>
      <price>5.95</price>
      <publish_date>2000-12-16</publish_date>
      <description>A former architect battles corporate zombies, 
      an evil sorceress, and her own childhood to become queen 
      of the world.</description>
   </book>
   <book id="bk103">
      <author>Corets, Eva</author>
      <title>Maeve Ascendant</title>
      <genre>Fantasy</genre>
      <price>5.95</price>
      <publish_date>2000-11-17</publish_date>
      <description>After the collapse of a nanotechnology 
      society in England, the young survivors lay the 
      foundation for a new society.</description>
   </book>
   <book id="bk104">
      <author>Corets, Eva</author>
      <title>Oberon's Legacy</title>
      <genre>Fantasy</genre>
      <price>5.95</price>
      <publish_date>2001-03-10</publish_date>
      <description>In post-apocalypse England, the mysterious 
      agent known only as Oberon helps to create a new life 
      for the inhabitants of London. Sequel to Maeve 
      Ascendant.</description>
   </book>
   <book id="bk105">
      <author>Corets, Eva</author>
      <title>The Sundered Grail</title>
      <genre>Fantasy</genre>
      <price>5.95</price>
      <publish_date>2001-09-10</publish_date>
      <description>The two daughters of Maeve, half-sisters, 
      battle one another for control of England. Sequel to 
      Oberon's Legacy.</description>
   </book>
   <book id="bk106">
      <author>Randall, Cynthia</author>
      <title>Lover Birds</title>
      <genre>Romance</genre>
      <price>4.95</price>
      <publish_date>2000-09-02</publish_date>
      <description>When Carla meets Paul at an ornithology 
      conference, tempers fly as feathers get ruffled.</description>
   </book>
   <book id="bk107">
      <author>Thurman, Paula</author>
      <title>Splish Splash</title>
      <genre>Romance</genre>
      <price>4.95</price>
      <publish_date>2000-11-02</publish_date>
      <description>A deep sea diver finds true love twenty 
      thousand leagues beneath the sea.</description>
   </book>
   <book id="bk108">
      <author>Knorr, Stefan</author>
      <title>Creepy Crawlies</title>
      <genre>Horror</genre>
      <price>4.95</price>
      <publish_date>2000-12-06</publish_date>
      <description>An anthology of horror stories about roaches,
      centipedes, scorpions  and other insects.</description>
   </book>
   <book id="bk109">
      <author>Kress, Peter</author>
      <title>Paradox Lost</title>
      <genre>Science Fiction</genre>
      <price>6.95</price>
      <publish_date>2000-11-02</publish_date>
      <description>After an inadvertant trip through a Heisenberg
      Uncertainty Device, James Salway discovers the problems 
      of being quantum.</description>
   </book>
   <book id="bk110">
      <author>O'Brien, Tim</author>
      <title>Microsoft .NET: The Programming Bible</title>
      <genre>Computer</genre>
      <price>36.95</price>
      <publish_date>2000-12-09</publish_date>
      <description>Microsoft's .NET initiative is explored in 
      detail in this deep programmer's reference.</description>
   </book>
   <book id="bk111">
      <author>O'Brien, Tim</author>
      <title>MSXML3: A Comprehensive Guide</title>
      <genre>Computer</genre>
      <price>36.95</price>
      <publish_date>2000-12-01</publish_date>
      <description>The Microsoft MSXML3 parser is covered in 
      detail, with attention to XML DOM interfaces, XSLT processing, 
      SAX and more.</description>
   </book>
   <book id="bk112">
      <author>Galos, Mike</author>
      <title>Visual Studio 7: A Comprehensive Guide</title>
      <genre>Computer</genre>
      <price>49.95</price>
      <publish_date>2001-04-16</publish_date>
      <description>Microsoft Visual Studio 7 is explored in depth,
      looking at how Visual Basic, Visual C++, C#, and ASP+ are 
      integrated into a comprehensive development 
      environment.</description>
   </book>
</catalog>'''

In [27]:
pd.read_xml(xml)

C:\Users\anush\AppData\Local\Temp\ipykernel_8544\2704978085.py:1: FutureWarning: Passing literal xml to 'read_xml' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_xml(xml)

,id,author,title,genre,price,publish_date,description
0,bk101,"Gambardella, Matthew",XML Developer's Guide,Computer,44.95,2000-10-01,An in-depth look at creating applications \n ...
1,bk102,"Ralls, Kim",Midnight Rain,Fantasy,5.95,2000-12-16,"A former architect battles corporate zombies, ..."
2,bk103,"Corets, Eva",Maeve Ascendant,Fantasy,5.95,2000-11-17,After the collapse of a nanotechnology \n ...
3,bk104,"Corets, Eva",Oberon's Legacy,Fantasy,5.95,2001-03-10,"In post-apocalypse England, the mysterious \n ..."
4,bk105,"Corets, Eva",The Sundered Grail,Fantasy,5.95,2001-09-10,"The two daughters of Maeve, half-sisters, \n ..."
5,bk106,"Randall, Cynthia",Lover Birds,Romance,4.95,2000-09-02,When Carla meets Paul at an ornithology \n ...
6,bk107,"Thurman, Paula",Splish Splash,Romance,4.95,2000-11-02,A deep sea diver finds true love twenty \n ...
7,bk108,"Knorr, Stefan",Creepy Crawlies,Horror,4.95,2000-12-06,"An anthology of horror stories about roaches,\..."
8,bk109,"Kress, Peter",Paradox Lost,Science Fiction,6.95,2000-11-02,After an inadvertant trip through a Heisenberg...
9,bk110,"O'Brien, Tim",Microsoft .NET: The Programming Bible,Computer,36.95,2000-12-09,Microsoft's .NET initiative is explored in \n ...
10,bk111,"O'Brien, Tim",MSXML3: A Comprehensive Guide,Computer,36.95,2000-12-01,The Microsoft MSXML3 parser is covered in \n ...
11,bk112,"Galos, Mike",Visual Studio 7: A Comprehensive Guide,Computer,49.95,2001-04-16,Microsoft Visual Studio 7 is explored in depth...

In [28]:
xml = '''<?xml version='1.0' encoding='utf-8'?>
<data>
  <row shape="square" degrees="360" sides="4.0" firstname="Krish"/>
  <row shape="circle" degrees="360"/>
  <row shape="triangle" degrees="180" sides="3.0" lastname="Naik"/>
</data>'''

In [35]:
df=pd.read_xml(xml,xpath=".//row")

C:\Users\anush\AppData\Local\Temp\ipykernel_8544\462757238.py:1: FutureWarning: Passing literal xml to 'read_xml' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  df=pd.read_xml(xml,xpath=".//row")

In [45]:
df
type(df)

pandas.core.frame.DataFrame

In [43]:
import numpy as np
replaced_df = df.replace({None: np.NaN})

In [44]:
replaced_df

      shape  degrees  sides firstname lastname
0    square      360    4.0     Krish      NaN
1    circle      360    NaN       NaN      NaN
2  triangle      180    3.0       NaN     Naik

In [46]:
xml = '''<?xml version='1.0' encoding='utf-8'?>
<doc:data xmlns:doc="https://example.com">
  <doc:row>
    <doc:shape>square</doc:shape>
    <doc:degrees>360</doc:degrees>
    <doc:sides>4.0</doc:sides>
  </doc:row>
  <doc:row>
    <doc:shape>circle</doc:shape>
    <doc:degrees>360</doc:degrees>
    <doc:sides/>
  </doc:row>
  <doc:row>
    <doc:shape>triangle</doc:shape>
    <doc:degrees>180</doc:degrees>
    <doc:sides>3.0</doc:sides>
  </doc:row>
</doc:data>'''

In [53]:
pd.read_xml(xml,xpath =".//doc:row",namespaces={"doc": "https://example.com"})

C:\Users\anush\AppData\Local\Temp\ipykernel_8544\3087745476.py:1: FutureWarning: Passing literal xml to 'read_xml' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_xml(xml,xpath =".//doc:row",namespaces={"doc": "https://example.com"})

      shape  degrees  sides
0    square      360    4.0
1    circle      360    NaN
2  triangle      180    3.0